English/ielts2/task4-prereading.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-20 Mon 23:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2c1c25c">1. Task4</a>
<ul>
<li><a href="#org759df95">1.1. 阅读与听力</a></li>
<li><a href="#org08fe1ef">1.2. questions</a></li>
<li><a href="#org4b415f4">1.3. first</a></li>
<li><a href="#org6f4c6a5">1.4. second 10</a></li>
<li><a href="#org417ed5b">1.5. Stoicism</a></li>
<li><a href="#orgaa0e8d4">1.6. article</a>
<ul>
<li><a href="#orga89e5f6">1.6.1. expressions</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2c1c25c" class="outline-2">
<h2 id="org2c1c25c"><span class="section-number-2">1.</span> Task4</h2>
<div class="outline-text-2" id="text-1">
<p>
Task4 课前任务：
精听+精读
所⽤素材：
剑雅16 第⼀套真题听⼒第⼀题
</p>
<ol class="org-ol">
<li>先听⽂章（⼀定不要先阅读听⼒脚本），答题，记录对错</li>
<li>认真阅读听⼒脚本，标注所有⽣词（⽂中含义），语法（参考新概念英语及三本语法书），摘抄习惯⽤法（并造句）</li>
<li>反复跟读edge或听⼒⾳频，⽆需熟读成诵，但请跟读到⾜够顺畅。拿不准就跟读50遍。</li>
<li>模拟考试，听⽂章，答题，记录对错。</li>
<li>对⽐1&amp;4 答题情况</li>
<li>做完前5步，请思考并写下，【阅读与听⼒】的关系。</li>
</ol>
</div>
<div id="outline-container-org759df95" class="outline-3">
<h3 id="org759df95"><span class="section-number-3">1.1.</span> 阅读与听力</h3>
<div class="outline-text-3" id="text-1-1">
<p>
阅读是听力的基础.
</p>
</div>
</div>

<div id="outline-container-org08fe1ef" class="outline-3">
<h3 id="org08fe1ef"><span class="section-number-3">1.2.</span> questions</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>跟读多少内容,才能做到听力通杀,而不是听过的材料?</li>
<li>单词单复数扣不扣分,同义词扣不扣分? 不扣</li>
<li>跟读50遍后,有些地方仍然需要思考才能知道说什么.为什么? 没过脑子</li>
</ol>
</div>
</div>
<div id="outline-container-org4b415f4" class="outline-3">
<h3 id="org4b415f4"><span class="section-number-3">1.3.</span> first</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>egg
t</li>
<li>tower
t</li>
<li>car
t</li>
<li>animal
animals</li>
<li>bridge
t</li>
<li>movie
t</li>
<li>decorate
t</li>
<li>wednesday
wednesdays</li>
<li>Fradstone
t</li>
<li>parking-lot
parking</li>
</ol>
</div>
</div>
<div id="outline-container-org6f4c6a5" class="outline-3">
<h3 id="org6f4c6a5"><span class="section-number-3">1.4.</span> second 10</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>egg</li>
<li>tower</li>
<li>car</li>
<li>animals</li>
<li>bridge</li>
<li>movie</li>
<li>decorate</li>
<li>Wednesdays</li>
<li>Fradstone</li>
<li>parking</li>
</ol>
</div>
</div>
<div id="outline-container-org417ed5b" class="outline-3">
<h3 id="org417ed5b"><span class="section-number-3">1.5.</span> Stoicism</h3>
<div class="outline-text-3" id="text-1-5">
<p class="verse">
Ancient philosophy is not just about talking or lecturing,<br />
&#xa0;or even reading long, dense books.<br />
In fact, it is something people have used throughout history<br />
&#xa0;– to solve their problems<br />
&#xa0;&#xa0;and to achieve their greatest triumphs.<br />
<br />
Specifically, I am referring to Stoicism,<br />
&#xa0;which, in my opinion, is the most practical of all philosophies<br />
&#xa0;&#xa0;and therefore the most appealing.<br />
Stoicism was founded in Ancient Greece by Zeno of Citium in the early 3rd century BC,<br />
&#xa0;but was practised by the likes of Epictetus, Cato, Seneca and Marcus Aurelius.<br />
Amazingly, we still have access to these ideas,<br />
&#xa0;despite the fact that the most famous Stoics never wrote anything down for publication.<br />
Cato definitely didn’t.<br />
Marcus Aurelius never intended his Meditations to be anything but personal.<br />
Seneca’s letters were, well,<br />
&#xa0;letters and Epictetus’ thoughts come to us by way of a note-taking student.<br />
<br />
Stoic principles were based on the idea<br />
&#xa0;that its followers could have an unshakable happiness in this life<br />
&#xa0;&#xa0;and the key to achieving this was virtue.<br />
The road to virtue, in turn, lay in understanding<br />
&#xa0;that destructive emotions, like anger and jealousy, are under our conscious control<br />
&#xa0;&#xa0;– they don’t have to control us,<br />
&#xa0;because we can learn to control them.<br />
In the words of Epictetus:<br />
&#xa0;“external events I cannot control,<br />
&#xa0;&#xa0;but the choices I make with regard to them.<br />
&#xa0;I do control”.<br />
<br />
The modern day philosopher and writer Nassim Nicholas Taleb defines a Stoic as someone<br />
&#xa0;who has a different perspective on experiences<br />
&#xa0;&#xa0;which most of us would see as wholly negative;<br />
&#xa0;a Stoic “transforms fear into caution,<br />
&#xa0;&#xa0;pain into transformation,<br />
&#xa0;&#xa0;mistakes into initiation and desire into undertaking”.<br />
Using this definition as a model,<br />
&#xa0;we can see that throughout the centuries Stoicism has been practised in more recent history<br />
&#xa0;&#xa0;&#xa0;by kings, presidents, artists, writers and entrepreneurs.<br />
<br />
The founding fathers of the United States were inspired by the philosophy.<br />
George Washington was introduced to Stoicism by his neighbours at age seventeen,<br />
&#xa0;and later, put on a play based on the life of Cato to inspire his men.<br />
Thomas Jefferson kept a copy of Seneca beside his bed.<br />
<br />
Writers and artists have also been inspired by the stoics.<br />
Eugène Delacroix, the renowned French Romantic artist<br />
&#xa0;(known best for his painting Liberty Leading the People) was an ardent Stoic,<br />
&#xa0;referring to it as his “consoling religion”.<br />
<br />
The economist Adam Smith’s theories on capitalism were significantly influenced by the Stoicism<br />
&#xa0;that he studied as a schoolboy,<br />
&#xa0;under a teacher who had translated Marcus Aurelius works.<br />
<br />
Today’s political leaders are no different,<br />
&#xa0;with many finding their inspiration from the ancient texts.<br />
Former US president Bill Clinton rereads Marcus Aurelius every single year,<br />
&#xa0;and many have compared former President Obama’s calm leadership style to that of Cato.<br />
Wen Jiabao the former prime minister of China,<br />
&#xa0;claims that Meditations is one of two books he travels with<br />
&#xa0;and that he has read it more than one hundred times over the course of his life.<br />
<br />
Stoicism had a profound influence on Albert Ellis,<br />
&#xa0;who invented Cognitive Behaviour Therapy,<br />
&#xa0;which is used to help people manage their problems<br />
&#xa0;&#xa0;by changing the way that they think and behave.<br />
It’s most commonly used to treat depression.<br />
The idea is that we can take control of our lives<br />
&#xa0;by challenging the irrational beliefs<br />
&#xa0;&#xa0;that create our faulty thinking, symptoms and behaviours by using logic instead.<br />
<br />
Stoicism has also become popular in the world of business.<br />
Stoic principles can build the resilience and state of mind<br />
&#xa0;&#xa0;required to overcome setbacks<br />
&#xa0;because Stoics teach turning obstacles into opportunity.<br />
A lesson every business entrepreneur needs to learn.<br />
<br />
I would argue that studying Stoicism is as relevant today<br />
&#xa0;as it was 2,000 years ago,<br />
&#xa0;thanks to its brilliant insights into how to lead a good life.<br />
At the very root of the thinking, there is a very simple way of living<br />
&#xa0;- control what you can and accept what you can’t.<br />
This is not as easy as it sounds<br />
&#xa0;and will require considerable practice<br />
&#xa0;– it can take a lifetime to master.<br />
The Stoics also believed the most important foundation<br />
&#xa0;for a good and happy life is not money, fame, power or pleasure,<br />
&#xa0;but having a disciplined and principled character<br />
&#xa0;– something which seems to resonate with many people today.<br />
</p>
</div>
</div>
<div id="outline-container-orgaa0e8d4" class="outline-3">
<h3 id="orgaa0e8d4"><span class="section-number-3">1.6.</span> article</h3>
<div class="outline-text-3" id="text-1-6">
<p class="verse">
1: Hello. Children's Engineering Workshops.<br />
<br />
2: Oh hello. I wanted some information about the workshops in the school holidays.<br />
<br />
1: Sure.<br />
<br />
2: I have two daughters who are interested.<br />
The younger one's Lydia, she's four,<br />
&#xa0;do you take children as young as that?<br />
<br />
1: Yes, our Tiny Engineers workshop is for four to five-year-olds.<br />
<br />
2: What sorts of activities do they do?<br />
<br />
1: All sorts. For example, they work together to <b>design a special cover that goes round an egg</b>,<br />
&#xa0;so that when it's inside they can drop it from a height and it doesn't break.<br />
Well, sometimes it does break but that's part of the fun!<br />
<br />
2: Right. And Lydia loves building things.<br />
<b>Is there any opportunity for her to</b> do that?<br />
<br />
1: Well, they have a competition to see who can make the highest tower.<br />
You'd <b>be amazed</b> how high they can go.<br />
<br />
2: Right.<br />
<br />
1: But they're learning all the time as well as having fun.<br />
For example, <b>one thing they do is to</b> design and build a car <b>that's attached to</b> a balloon,<br />
&#xa0;and the force of the air in that actually powers the car and makes it move along.<br />
They go really fast too.<br />
<br />
2: OK, well, all this sounds perfect.<br />
<br />
2: Now Carly, that's my older daughter,<br />
&#xa0;&#xa0;has just had her seventh birthday,<br />
&#xa0;so presumably she'd be in a different group?<br />
<br />
1: Yes, she'd be in the Junior Engineers.<br />
That's for children from six to eight.<br />
<br />
2: And do they do the same sorts of activities?<br />
<br />
1: Some are the same, but a bit more advanced.<br />
So they work out how to build model vehicles, things like cars and trucks,<br />
&#xa0;but also how to construct animals using the same sorts of material and technique,<br />
&#xa0;and then they learn how they can program them and make them move.<br />
<br />
2: So they learn a bit of coding?<br />
<br />
1: They do. They pick it up really quickly.<br />
We're there to help if they need it, but they learn from one another too.<br />
<br />
2: Right. And do they have competitions too?<br />
<br />
1: Yes, with the Junior Engineers,<br />
&#xa0;it's to use recycled materials like card and wood to build a bridge,<br />
&#xa0;&#xa0;and the longest one gets a prize.<br />
<br />
2: That sounds fun.<br />
I wouldn't mind doing that myself!<br />
<br />
1: Then they have something a bit different,<br />
&#xa0;this is from Laokaoya website,<br />
&#xa0;which is to think up an idea for a five-minute movie and then film it,<br />
&#xa0;using special animation software.<br />
You'd be amazed what they come up with.<br />
<br />
2: And of course, that's something they can put on their phone<br />
&#xa0;and take home to show all their friends.<br />
<br />
1: Exactly.<br />
And then they also build a robot in the shape of a human,<br />
&#xa0;and they decorate it and program it<br />
&#xa0;&#xa0;so that it can move its arms and legs.<br />
<br />
2: Perfect.	So, is it the same price as the Tiny Engineers?<br />
<br />
1: It's just a bit more: £50 for the five weeks<br />
<br />
2: And are the classes on a Monday, too?<br />
<br />
1: They used to be,<br />
&#xa0;but we found it didn't give our staff enough time to clear up after the first workshop,<br />
&#xa0;so we moved them to Wednesdays.<br />
The classes are held in the morning from ten to eleven.<br />
<br />
2: OK. That's better for me actually.<br />
And what about the location?<br />
Where exactly are the workshops held?<br />
<br />
1: They're in building 10A – there's a big sign on the door,<br />
&#xa0;you can't miss it,<br />
&#xa0;and that's in Fradstone Industrial Estate.<br />
<br />
2: Sorry?<br />
<br />
1: Fradstone – that's F-R-A-D-S-T-O-N-E.<br />
<br />
2: And that's in Grasford, isn't it?<br />
<br />
1: Yes, up past the station.<br />
<br />
2: And will I have any parking problems there?<br />
<br />
1: No, there's always plenty available.<br />
So would you like to enroll Lydia and Carly now?<br />
<br />
2: OK.<br />
<br />
1: So can I have your full name &#x2026;<br />
</p>
</div>
<div id="outline-container-orga89e5f6" class="outline-4">
<h4 id="orga89e5f6"><span class="section-number-4">1.6.1.</span> expressions</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
workshop: 研习班
</p>
<ul class="org-ul">
<li>He decided that the workshop would be held last Friday.</li>
<li>He wanted his daughter to enroll for the workshop.</li>
<li>He is reminiscing about the workshop in his childhood.</li>
</ul>
<p>
want some information about sth.: 想要某物的信息
</p>
<ul class="org-ul">
<li>I want some information about Jack who works for Apple Corporation.</li>
<li>He wanted some information about MBA from Harvard.</li>
<li>When he wanted some information about the workshop, he didn't receive a warm welcome.</li>
</ul>
<p>
design a adj. cover that goes round sth. : 设计一个保护套包裹住某物
</p>
<ul class="org-ul">
<li>He's aim is to design a special cover that goes round a computer.</li>
<li>He managed to design a special cover that goes round an egg to prevent it from being broken.</li>
<li>He designed a beautiful cover that goes round strawberries
at a time when these were very popular.</li>
</ul>
<p>
there is an opportunity for sb. to do sth.: 对某人有机会做某事
</p>
<ul class="org-ul">
<li>There is an opportunity for the application to pop up a video.</li>
<li>There used to be an opportunity for the offical to back off.</li>
<li>Is there any opportunity for me to apply for a MBA from Harvard.</li>
</ul>
<p>
be amazed + &#x2026;: 对&#x2026;吃惊
</p>
<ul class="org-ul">
<li>I am amazed that he wrote a story in recognition of his cat.</li>
<li>I am amazed that he writes this story as a tribute to his dead wife.</li>
<li>I am amazed that the loss of Titanic makes it impossible for me to meet her again.</li>
</ul>
<p>
one thing sb. does is to do sth.:某人做的一件事是做某事
</p>
<ul class="org-ul">
<li>One thing the group of pop singers is to give a performance at worker's club this night.</li>
<li>One thing I do is to finish my homework in time.</li>
<li>One thing he do is to complain about this wicked world.</li>
</ul>
<p>
A. be attached to B.: B绑到A上
</p>
<ul class="org-ul">
<li>The car that's attached to a balloon is a gift for my wife.</li>
<li>When she saw car attched to the balloon  which brought a smile to her face.</li>
<li>I don't have a lot of patience to attach a balloon to a car.</li>
</ul>
<p>
the force of air/water: 空气的力量
</p>
<ul class="org-ul">
<li>The force of air is powering the car and making it move.</li>
<li>The force of air must have powered the car and made it move.</li>
<li>The broken car reminded him of the force of air in the accident.</li>
</ul>
<p>
presumably: 估计是
</p>
<ul class="org-ul">
<li>Presumably, his rise in salary gave him encouragement to ask for phone number of the girl.</li>
<li>Presumably, our cat contribute to the broken vase.</li>
<li>Presumably, they held a party to mark the occassion.</li>
</ul>
<p>
advanced: 更高级的
</p>
<ul class="org-ul">
<li>The advanced workshop is a bit more expensive than another.</li>
<li>We should all remember him for the advanced class that he developed in his early years.</li>
<li>He decided to devote himself to the advanced English course.</li>
</ul>
<p>
construct A. using B.: 用B来构造A
</p>
<ul class="org-ul">
<li>It is a curious coincidence that people in Ancient China constructed houses using wood and stone.</li>
<li>In his honor, they constructed a bridge using wood purely.</li>
<li>While he constructed a wooden pig using the special materials, he lost his patience.</li>
</ul>
<p>
pick sth. up: 某事进步
</p>
<ul class="org-ul">
<li>Sorry to interrupt, but he picked it up very quickly.</li>
<li>He devoted himself to the gardening after retire and picked it up very quickly.</li>
<li>If you worked hard, you would also pick it up very quickly.</li>
</ul>
<p>
use A. to do B.: 用A来做B
</p>
<ul class="org-ul">
<li>In the end, he managed to use the keyboard to input text in his computer.</li>
<li>He noticed with dismay that he couldn't use the knife to cut the pineapple.</li>
<li>He used the editor to write an article on engineering workshop at tremendous speed.</li>
</ul>
<p>
come up with=think up an idea for sth.: 为某事想出主意
</p>
<ul class="org-ul">
<li>Believe it or not, it's your child who thought up an idea for playing truent from school.</li>
<li>He managed to think up an idea for hunting for the puma at large.</li>
<li>He always thinks up an idea for raising money.</li>
</ul>
<p>
A. in the shape of B.: B形状的A
</p>
<ul class="org-ul">
<li>He succeeded in constructing a robot in the shape of human.</li>
<li>My wife sent me a cake in the shape of a dog.</li>
<li>A robot in the shape of human is moving in a circle in the exhibition.</li>
</ul>
<p>
give sb. enough time to do sth.: 给某人足够的时间去做某事
</p>
<ul class="org-ul">
<li>The busy traffic didn't give him enough time to get away from the police.</li>
<li>If the police had arrived on scene at the first time,
it wouldn't have given us enough time to escape.</li>
<li>It gives him enough time to commit a murder.</li>
</ul>
<p>
up past sp.: 过了某处
</p>
<ul class="org-ul">
<li>Our workshop is up past the station.</li>
<li>There is a big sign on the build which is up past the station.</li>
<li>Are you suggesting that the company is up past the mall.</li>
</ul>
<p>
enrol: 报名
</p>
<ul class="org-ul">
<li>We will give you enough time to consider before you enrol in our workshop.</li>
<li>I want to enrol my daughter for 'The Art of expression'.</li>
<li>He hesitated to enrol in the IELTS course of Mr. Leo.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: DESKTOP-13B7HQM</p>
<p class="date">Created: 2024-05-20 Mon 23:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
